testCases/YabukiNakabeppu_ML_scriven/0.orig/fluid/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

#include "../../constant/runParams"

internalField   uniform 1;

boundaryField
{
	top
	{
		type	zeroGradient;
	}
	
	right
	{
		type	zeroGradient;
	}
	
	axis
	{
		type	empty;
	}
	
	back
	{
		type	wedge;
	}
	
	front
	{
		type	wedge;
	}
	
	fluid_to_solid
	{
		type	constantAlphaContactAngle;
		theta0	$CA;
		limit	gradient;
		value	uniform 0;
	}
}		

